In [10]:
from pandas import Series

series1=Series([20,40,60,80,100])
series2=Series([1.5,1.8,1.9,1.4,1.1])
series3=Series([22,1993,13,5],index=["Age","Year","Date","Month"])
series4=Series([10,2000,24,10],index=["Age","Year","Date","Month"])
print(series1)
print(series2)
print(series3)
print(series3+series4)

0     20
1     40
2     60
3     80
4    100
dtype: int64
0    1.5
1    1.8
2    1.9
3    1.4
4    1.1
dtype: float64
Age        22
Year     1993
Date       13
Month       5
dtype: int64
Age        32
Year     3993
Date       37
Month      15
dtype: int64

In [11]:
from pandas import DataFrame
data1={"Age":[20,22,10],"Year":[1988,1990,1995],"Date":[17,13,26],"Month":[4,2,10]}
data1

{'Age': [20, 22, 10],
 'Year': [1988, 1990, 1995],
 'Date': [17, 13, 26],
 'Month': [4, 2, 10]}

In [12]:
frame1=DataFrame(data1)
frame1

   Age  Year  Date  Month
0   20  1988    17      4
1   22  1990    13      2
2   10  1995    26     10

In [13]:
data2={"Age":[31,24,18],"Year":[1946,1955,1970],"Date":[15,14,21],"Month":[10,10,1]}
data2

{'Age': [31, 24, 18],
 'Year': [1946, 1955, 1970],
 'Date': [15, 14, 21],
 'Month': [10, 10, 1]}

In [14]:
frame2=DataFrame(data2)
frame2

   Age  Year  Date  Month
0   31  1946    15     10
1   24  1955    14     10
2   18  1970    21      1

In [15]:
frame1+frame2

   Age  Year  Date  Month
0   51  3934    32     14
1   46  3945    27     12
2   28  3965    47     11

In [16]:
frame1-frame2

   Age  Year  Date  Month
0  -11    42     2     -6
1   -2    35    -1     -8
2   -8    25     5      9

In [18]:
frame1-series3

   Age  Year  Date  Month
0   -2    -5     4     -1
1    0    -3     0     -3
2  -12     2    13      5

In [19]:
frame1-series4

   Age  Year  Date  Month
0   10   -12    -7     -6
1   12   -10   -11     -8
2    0    -5     2      0